{
  "articles": [
    {
      "id": 1,
      "category": "برنامه نویسی",
      "image": "/assets/images/kid-programming00-400x240.jpg",
      "author": "نازنین کریمی مقدم",
      "date": "2022/01/01",
      "period": 13,
      "seen": 90,
      "subject": "13 دلیل برای اهمیت یادگیری برنامه نویسی برای کودکان",
      "body": "چرا کودکان باید برنامه نویسی یاد بگیرند؟ دادن بهترین شانس موفقیت به فرزندان در آینده و همچنین کمک به رشد تحصیلی او در سالهای شکل گیری شخصیت او، کاری است که هر پدر و مادری تمایل به انجام آن دارد. یادگیری کدنویسی و برنامه ‌نویسی یکی از راه‌هایی است که از طریق آن می‌توان کودکان را به بهترین شکل برای آینده آماده کرد، باعث پیشرفت شان در مدرسه شد و روند یادگیری شان را حمایت و تقویت کرد. در حقیقت، یادگیری برنامه نویسی فقط مزایای تحصیلی و شغلی را به همراه ندارد؛ تحقیقات نشان می‌دهد که آشنایی با برنامه نویسی موجب رشد مهارت‌های دیگر مانند سازماندهی مسائل، پشتکار، حل مسئله و حتی اعتماد به نفس می‌شود. در این مقاله درمورد فواید برنامه نویسی برای کودکان صحبت می‌کنیم و به بررسی مزایای آموزش برنامه نویسی برای کودکان و تاثیر آن بر خلاقیت و شیوه تفکر می‌پردازیم."
    },
    {
      "id": 2,
      "category": "آموزش",
      "image": "/assets/images/coding-vs-programming00-400x240.jpg",
      "author": "نازنین کریمی مقدم",
      "date": "2022/05/03",
      "period": 13,
      "seen": 10,
      "subject": "7 تفاوت برنامه نویسی و کد نویسی چیست؟",
      "body": "همانطور که می‌دانید، هر اصطلاح یا واژه‌ای معنای خاص خود را در زندگی روزمره دارد. در شرکتهای توسعه نرم افزار نیز این قانون صادق است: اصطلاح گوناگون معانی مختلفی دارند. تمایز میان مفهوم کد نویسی و برنامه نویسی نمونه‌ای از این اصطلاحات است که از قضا یکی از رایج‌ترین اصطلاحات در حوزه توسعه نرم افزار نیز هستند. اگر در بخش توسعه نرم افزار نیستید، صحبت کردن درمورد تفاوت کدنویسی و برنامه نویسی بی معنی است. اما اگر از فعالان جدی این حوزه هستید بهتر است تا هر چه سریعتر با این دو مفهوم و تفاوتی که با یکدیگر دارند آشنا شوید؛ چرا که اگر از این تعاریف غافل شوید، هنگام کاریابی دچار مشکل شده و نمی‌توانید وظایف و انتظاراتی که کارفرما از شما دارد را به خوبی متوجه شوید. به همین دلیل در این مقاله تصمیم گرفتیم که به بررسی موردی تفاوت کدنویسی و برنامه نویسی بپردازیم. پس با ما همراه باشید.کدنویسی چیست؟ کدنویسی فرآیند تبدیل کدها از زبان انسان به زبان قابل فهم توسط ماشین است. از آنجایی که کدنویسی پایه برنامه نویسی است، ممکن است به عنوان زیرمجموعه برنامه نویسی نیز شناخته شود. یک کدنویس (coder) می‌تواند بسته به وظیفه‌ای که دارد، به یک یا چندین زبان مسلط باشد و قادر به نوشتن کد به زبانهای مختلف کامپیوتری از جمله جاوا، سی، پایتون و R باشد. در نهایت با استفاده از کدنویسی دستورالعمل‌ها و اطلاعات کامپیوتری انتقال داده می‌شود. “کد منبع” اصطلاحی است که برای توصیف این دستورالعملها استفاده می‌شود."
    }
  ],
  "comments": [
    {
      "parentId": 0,
      "id": 1,
      "articleId": 1,
      "name": "mahdi",
      "email": "mahdi@gmail.com",
      "description": "مقاله تون رو مطالعه کردم خیلی عالی بود ، متشکرم از تیم تحریریه سون لرن.من میخواستم از سنین کودکی فرزندم رو با برنامه نویسی آشنا کنم ولی خب نمیدونم که علاقه داره یا نه ، خواستم ازتون راهنمایی بگیرم که چطور میتونم بفهمم که علاقه به برنامه نویسی داره یا نه؟",
      "rate": 5,
      "date": "2023-05-08T15:16:38.726Z"
    },
    {
      "parentId": 1,
      "id": 2,
      "articleId": 1,
      "name": "taraneh",
      "email": "taraneh@gmail.com",
      "description": "درود خوشحالیم که مقاله براتون مفید بوده. معمولا افرادی که به پازل علاقه مند هستند برنامه نویسی رو هم دوست خواهند داشت اما در کل در کودکی یکم این تشخیص سخت هست چون کودک یک روحیه تنوع طلبی قوی رو در خودش داره و از اون سمت خودش هم دقیق نمیدونه که دقیقا چه چیزی رو دوست داره تا شخصیتش شکل بگیره. بهترین کار اینه که کار با اسکرچ رو شروع کنه. اسکرچ یچیزی بین برنامه نویسی و پازله، کار باهاش خیلی ساده هست و هیچ پیش زمینه ای هم نمیخواد. اگر با اسکرچ ارتباط خوبی برقرار کرد یعنی برنامه نویسی رو هم دوست خواهد داشت.",
      "rate": 5,
      "date": "2023-05-08T08:15:16.807Z"
    },
    {
      "parentId": 0,
      "id": 3,
      "articleId": 2,
      "name": "bahar",
      "email": "bahar@gmail.com",
      "description": "مقاله بسیار مفیدی است.",
      "rate": 5,
      "date": "2023-05-08T08:20:49.194Z"
    },
    {
      "parentId": 3,
      "id": 4,
      "articleId": 2,
      "name": "taraneh",
      "email": "taraneh@gmail.com",
      "description": "ممنون از ثبت نظرتون",
      "rate": 5,
      "date": "2023-05-08T08:21:26.306Z"
    },
    {
      "parentId": 0,
      "id": 5,
      "articleId": 1,
      "name": "negar",
      "email": "negar@gmail.com",
      "description": "یک نظر",
      "rate": 3,
      "date": "2023-05-08T15:39:03.723Z"
    },
    {
      "parentId": 5,
      "id": 6,
      "articleId": 1,
      "name": "taraneh",
      "email": "taraneh@gmail.com",
      "description": "ممنون از شما",
      "rate": 5,
      "date": "2023-05-08T15:39:34.992Z"
    },
    {
      "parentId": 5,
      "id": 7,
      "articleId": 1,
      "name": "bahar",
      "email": "bahar@gmail.com",
      "description": "ممنون",
      "rate": 5,
      "date": "2023-05-08T15:45:56.052Z"
    },
    {
      "parentId": 0,
      "id": 8,
      "articleId": 1,
      "name": "mahdi",
      "email": "mahdi@gmail.com",
      "description": "نظر جدید است",
      "rate": 1,
      "date": "2023-05-08T15:46:58.028Z"
    }
  ]
}